CURRENCY_SYMBOLS = {
    "RUB": "₽",
    "USD": "$",
    "EUR": "€",
    "GBP": "£",
    "CHF": "₣",
    "CNY": "¥",
    "JPY": "¥",
    "HKD": "$",       # Гонконгский доллар
    "AED": "د.إ",     # Дирхам ОАЭ
    "KZT": "₸",
    "KGS": "som",
    "UZS": "so'm",
    "AZN": "₼",
    "AMD": "֏",

    # Дополнительные валюты
    "CAD": "$",
    "AUD": "$",
    "HKD": "$",
    # остальные могут отображаться просто кодом
}


CURRENCY_FLAGS = {
    "RUB": "🇷🇺",
    "USD": "🇺🇸",
    "EUR": "🇪🇺",
    "GBP": "🇬🇧",
    "CHF": "🇨🇭",
    "CNY": "🇨🇳",
    "JPY": "🇯🇵",
    "HKD": "🇭🇰",
    "AED": "🇦🇪",
    "AUD": "🇦🇺",
    "CAD": "🇨🇦",
    "KZT": "🇰🇿",
    "KGS": "🇰🇬",
    "UZS": "🇺🇿",
    "AZN": "🇦🇿",
    "AMD": "🇦🇲",
}





CURRENCY_CHOISE = (
    ('RUB', 'RUB'),
    ('USD', 'USD'),
    ('EUR', 'EUR'),
    ('GBP', 'GBP'),
    ('CHF', 'CHF'),
    ('JPY', 'JPY'),
    ('CNY', 'CNY'),
    ('CAD', 'CAD'),
    ('AUD', 'AUD'),
    ('HKD', 'HKD'),
    ('KZT', 'KZT'),
    ('KGS', 'KGS'),
    ('UZS', 'UZS'),
    ('AZN', 'AZN'),
    ('AMD', 'AMD'),
    ('AED', 'AED'),

)

COUNTRY_CHOICES = (
    ('RU', 'Россия'),
    ('KZ', 'Казахстан'),
    ('BY', 'Беларусь'),
    ('KG', 'Киргизия'),
    ('UZ', 'Узбекистан'),
    ('TJ', 'Таджикистан'),
    ('AM', 'Армения'),
    ('AZ', 'Азербайджан'),
    ('GE', 'Грузия'),
    ('MD', 'Молдова'),
    ('UA', 'Украина'),
    ('EE', 'Эстония'),
    ('LV', 'Латвия'),
    ('LT', 'Литва'),
    ('PL', 'Польша'),
    ('DE', 'Германия'),
    ('FR', 'Франция'),
    ('IT', 'Италия'),
    ('ES', 'Испания'),
    ('PT', 'Португалия'),
    ('GR', 'Греция'),
    ('CY', 'Кипр'),
    ('TR', 'Турция'),
    ('CN', 'Китай'),
    ('JP', 'Япония'),
    ('KR', 'Корея'),
    ('US', 'США'),
    ('CA', 'Канада'),
    ('BR', 'Бразилия'),
    ('AU', 'Австралия'),
    ('NZ', 'Новая Зеландия'),
    ('GB', 'Великобритания'),
    ('IE', 'Ирландия'),
    ('NL', 'Нидерланды'),
    ('BE', 'Бельгия'),
    ('LU', 'Люксембург'),
    ('DK', 'Дания'),
    ('SE', 'Швеция'),
    ('NO', 'Норвегия'),
    ('FI', 'Финляндия'),
    ('IS', 'Исландия'),
    ('CH', 'Швейцария'),
    ('AT', 'Австрия'),
    ('HU', 'Венгрия'),
    ('CZ', 'Чехия'),
    ('SK', 'Словакия'),
    ('SI', 'Словения'),
    ('HR', 'Хорватия'),
    ('BA', 'Босния и Герцеговина'),
    ('RS', 'Сербия'),
    ('ME', 'Черногория'),
    ('MK', 'Македония'),
    ('AL', 'Албания'),
    ('BG', 'Болгария'),
    ('RO', 'Румыния'),
)

LA_STATUS_CHOICES = (
    (0, 'Черновик'),
    (1, 'Подписан'),
)

ACCURALS_METHODS = (
    ('fix_rates','Фиксированные ставки'),
    ('lump_sum','Фиксированный платеж'),
    ('royalty','Процент с оборота')
)

EF_DATE_MODES = [
        ('fixed', 'Фиксированная дата'),
        ('offset', 'После события'),
    ]

EF_DATE_EVENTS = [
        ('date_signed', 'Дата подписания'),
        ('date_start', 'Дата начала аренды'),
        ('date_finish', 'Дата окончания аренды'),
    ]

VAR_PENALTIES = [
    ('key_rate', 'Ключевая ставка'),
]

VAR_INDEXATION = [
    ('inflation_rate', 'ИПЦ'),
]